module.exports = {
  rules: {
    /**
     * 禁止混合使用不同的操作符:
     * - 禁止 `%`, `**` 之间混用
     * - 禁止 `%` 与其它运算符之间混用
     * - 禁止乘除运算符之间混用
     * - 禁止位运算符之间的任何混用
     * - 禁止比较运算符之间混用
     * - 禁止 `&&`, `||` 之间混用
     */
    'no-mixed-operators': ['error', {
      groups: [
        ['%', '**'],
        ['%', '+'],
        ['%', '-'],
        ['%', '*'],
        ['%', '/'],
        ['&', '|', '<<', '>>', '>>>'],
        ['==', '!=', '===', '!=='],
        ['&&', '||'],
      ],
      allowSamePrecedence: false
    }]
  }
};
